app/controllers/api/v1/sessions_controller.rb

UPDATE "users" SET "current_sign_in_at" = ?, "sign_in_count" = ?, "updated_at" = ? WHERE "users"."id" = 1  [["current_sign_in_at", "2014-05-08 21:46:12.312334"], ["sign_in_count", 2], ["updated_at", "2014-05-08 21:46:12.313156"]]
---
  def destroy
    warden.authenticate!(:scope => resource_name, :recall => "#{controller_path}#failure")
    current_user.update_column(:authentication_token, nil)